namespace task
{
    /// <summary>
    /// Методы агрегирования
    ///
    /// 1) Выбрать товары категории Mobile, цена которых превышает 1000 грн.
    /// 2) Вывести название и цену тех товаров, которые не относятся к категории Kitchen, цена которых превышает 1000 грн.
    /// 3) Вычислить среднее значение всех цен товаров.
    /// 4) Вывести список категорий без повторений.
    /// 5) Вывести названия и категории товаров в алфавитном порядке, упорядоченных по названию.
    /// 6) Посчитать суммарное количество товаров категорий Сar и Mobile.
    /// 7) Вывести список категорий и количество товаров каждой категории. 
    /// </summary>
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}